//1. За да се ползва react се инсталира един готов пакет: npm install -g create-react-app и също така 
//npx create-react-app react-feb (последното е името на приложението, което си задаваме от сега) и ще инсталира dependencies и всичко необходимо, за да си билднем app-a
//2. Отново с npm start и на същото място си търсим какво стартира;
//3. В src index.js е папката, от която се стартира app-a. Накрая има 
ReactDOM.render(<App />, document.getElementById('root')); 
//където ReactDOM.render е метода, който ни вкарва съдържанието в index.html файла, в даден елемент (в слуая 'root')
//4. Описвам неща в idnex.js....

///////////Tip////////
//може да се ползват и function(){}, но винаги трябва да се return-ва. Добрата практика е да се използват arrow с кръгли скоби, за да се връща компонента, защото в реакт винаги трябва да се return-ва нещо - 
//()=>(<div>Hello</div>) - автоматично го ретърнва, но тук не мога да ползвам js - let something =....
//Ако все пак ползвам function то трябва да е  или в arrow с {} и просто return-a е в скоби и готово
//Function(){
// return(
//    <div>hello</div>
// );
//}
//////// /Tip////////

//5. Някои html атрибути като class са резервирани и в jsx са с друго име (примерно classname)