//Templating:
//изваждаме САМО това, което се повтаря във всички html-и в отделен файл. В случая е файл main.hbs, който задаваме, че ще е дифолтен темплейт в този случай във файл express.js и в него пишем КЪДЕ ще наливаме динамичната информация с {{{body}}} - задължително по този начин

app.engine('.hbs', handlebars({
    defaultLayout: 'main',      //тук сме оказали реално в кой таг И файл ще пълним съдържанието. Това е темплейта. Създавам папка layouts и в нея файл main.hbs, в който ще сложа повтарящите се неща и трия всичко от main tag-a
    extname: '.hbs'
}));

//от другите файлове изтриваме всичко, което имаме в темплейтинга и трябва да си остане само съдържанието на main tag-a, но без самият tag;

//controllers: там реално се извършва самият routing;

//error handling:
//в случая имаме css за грешки, който можем да използваме като създадем съответния tag в темплейта и му кажем, че ако има грешки да се появява с {{if}} и да изписва директно грешката

