let run = function (b=3) {                             //това е expresion фунцкия и е по-правилно да се ползва така
    console.log("run")                                 //можем да задаваме и дефолтна стойност
}

let walking = (x,y) => {                               //lambda funct още по-съкратен фариант на писане на функция
    console.log(x+y)
}
walking(2,3)

(function run(a, b) {                                    //IIFE - функция, която веднага сама се извиква
    console.log(sum(a,b));                          //използва се главно, за да си капсулираме променливите
})(10,20);                                          //всеки JS file в WEB е добра практика да се съдържа в IIFE

arguments[0]                                         //когато е написано във функцията съдържа като масив всички
                                                     // аргументи, с които е извикана функцията. Когато е lambda
                                                     // не можем да ползваме arguments

return                                               //прекратява изпънението на функцията и връща резултат

let first = function (a,b,c) {
    b=b||10;                                         //по този начин казваме, ако не е подадена стойност на параметър b
                                                     //да го избира дифолтно 10
}

douglas crockford                                    //трябва да гледам в youtube негови лекции на теме JavaScript, ама
                                                     //задължително



